#include<stdio.h>
int main()
{
	int a[4] = { 1,2,3,4 };
	int* ptr1 = (int*)(&a + 1);
	int* ptr2 = (int*)((int)a + 1);
	printf("%x,%x", ptr1[-1], *ptr2);
	return 0;
}
//电脑是以小端存储   数组a   01 00 00 00   02 00 00 00   03 00 00 00   04 00 00 00
//小端：低位存到低地址 高位存到高地址
//ptr1[-1] == *(ptr1+(-1)) == *(ptr1-1) ptr1为地址 地址-1要向前取四个字节 取到04 00 00 00的地址后解引用得到4
//4以16进制打印则为0x4
//a为数组首元素地址 强制转换为整形后加整数1 再强制转换回地址 相当于地址向后取一个字节 取到00 而整形指针会向后访问四个字节 则为 00 00 00 02 
//以小端形式存储就以小端形式取出  0x02 00 00 00 打印时省略第一个零 0x2000000
//则结果为4,2000000
