#include<stdio.h>
//9.0
//1001.0
//(-1)^0 * 1.001 * 2^3
//(-1)^s * M     * 2^E
//s - 0
//M - 1.001
//E - 3
//
//0.5
//0.1
//(-1)^0 * 1.0 * 2^-1
//s = 0
//M = 1.0
//E = -1
//E + 127 = 126(由于八位的E没有存符号位的 所以无法直接表示负数 需要加一个中间值 8位的中间值为127)
//E加中间值是固定的规则 不是只有E为负数才加 正负数都需要加中间值
//由于M的范围在1到2之前 整数位必然是一个一 所以直接不存整数位的一 多存一位小数可以提升精度
//所以M中只存小数部分
int main()
{
	int n = 9;
	//00000000000000000000000000001001-补码
	float* pFloat = (float*)&n;
	printf("n的值：%d\n", n);//9
	printf("pFloat的值为：%f\n", *pFloat);
	//0 00000000 0000000000000000001001
	//(-1)^0 * 0.000000000000000001001 * 2^-126
	//%f只取到小数点后面六位 所以结果为0.000000
	*pFloat = 9.0;
	printf("num的值为：%d\n", n);
	//1001.0
	// (-1)^0 * 1.001 * 2^3
	//0 100000010 00100000000000000000000
	//010000001000100000000000000000000当打印整数时 此认为保存的是补码 首位为零 所以是正数 正数原反补都一样所以直接按此值打印
	printf("pFloat的值为：%f", *pFloat);//%f 直接打印9.000000
	return 0;
}